*>================================================*
*> BANK-CLIENT.cpy                                *
*> Estructura de registro de cliente              *
*>================================================*

*>--- ESTRUCTURA DE CLIENTE
01 WS-CLIENT-RECORD.
    05 WS-CLIENT-DNI             PIC X(9).
    05 WS-CLIENT-NAME            PIC X(40).
    05 WS-CLIENT-ADDRESS         PIC X(50).
    05 WS-CLIENT-PHONE           PIC X(15).
    05 WS-CLIENT-EMAIL           PIC X(50).
    05 WS-CLIENT-REGISTRATION-DATE PIC 9(8).
